Tekla Open API Reference for Tekla Structures 2025
ReinforcementMeshMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.ReinforcementMeshMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
CcCrossing
Returns the crossing cc property element type.
CcExactCrossing
Returns the crossing cc exact property element type.
CcExactLongitudinal
Returns the longitudinal cc exact property element type.
CcLongitudinal
Returns the longitudinal cc property element type.
CcMaxCrossing
Returns the crossing cc max property element type.
CcMaxLongitudinal
Returns the longitudinal cc max property element type.
CcMinCrossing
Returns the crossing cc min property element type.
CcMinLongitudinal
Returns the longitudinal cc min property element type.
Class
Returns the class property element type.
DiameterCrossing
Returns the crossing diameter property element type.
DiameterLongitudinal
Returns the longitudinal diameter property element type.
Grade
Returns the grade property element type.
MeshLength
Returns the mesh length property element type.
MeshWidth
Returns the mesh width property element type.
Name
Returns the name property element type.
Number
Returns the number property element type.
Position
Returns the position property element type.
Shape
Returns the shape property element type.
Size
Returns the size property element type.
Weight
Returns the weight property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.ReinforcementMeshMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace